import React, { useState, useEffect } from "react";
import "./scss/indetail.scss";
import D1 from "./img/d-1.jpg";
import D2 from "./img/d-2.jpg";
import D3 from "./img/d-3.jpg";
import D4 from "./img/d-4.jpg";
import { useParams } from "react-router-dom";
import { Link } from "react-router-dom";

function Indetail() {
  const [content, setContent] = useState([]);
  const { id } = useParams();

  const arrContent = [
    {
      id: 1,
      title: "มาตรฐานสีของสายไฟ เรื่องสำคัญด้านความปลอดภัย ที่ช่างทุกคนควรรู้",
      htmlString:
        '<p>ปัจจุบัน มีการอัพเดทมาตรฐานใหม่เป็น มอก. 11-2553 เพื่อให้ช่างไฟและคนทำงานด้านระบบไฟฟ้าได้อัพเดททันกับมาตรฐานนี้ เรามาดูความเปลี่ยนแปลงกันว่ามีอะไรบ้าง</p><p>ทำไมถึงต้องเปลี่ยนมาตรฐาน?</p><p>เพื่อเป็นการปรับปรุงจากของเดิม (มอก.11-2531) ซึ่งประกาศใช้มานานแล้ว ให้มีความทันสมัยและสอดคล้องกับมาตรฐานสากล IEC Standards ซึ่งใช้กันแพร่หลายทั่วโลก</p><p>ข้อดีจากมาตรฐานใหม่นี้ ช่างจะทำงานเป็นมาตรฐานเดียวกันกับสากลที่ใช้กันและเป็นที่ยอมรับอย่างกว้างขวาง สามารถเข้าใจได้ง่ายและตรงไปในแนวทางเดียวกัน</p><p>สามารถดูตารางในภาพประกอบได้เลย</p><p>ซื้อสายไฟออนไลน์ได้แล้ว กดสั่งง่ายๆ ส่งจากโรงงานตรงถึงบ้านคุณ</p><p><a href="https://linktr.ee/triplen.cable">https://linktr.ee/triplen.cable</a></p><p>#สายไฟฟ้าทริปเปิ้ลเอ็น #TripleNcable</p><p>#ทองแดงดีพีวีซีคุณภาพเต็มเมตรเต็มม้วน</p>',
      img: D1,
    },
    {
      id: 2,
      title: "สาย IEC 53 และ VCT ต่างกันอย่างไร ",
      htmlString:
        '<p>แม้หน้าตาและโครงสร้างของสายทั้งสองนั้น จะเป็นสายตัวนำทองแดงฝอย หุ้มด้วยฉนวนและเปลือก PVC เหมือนกันทั้งคู่</p><p>แต่จะมีความแตกต่างกันอยู่ที่ “ระดับแรงดันไฟฟ้า“ และ “ขนาดของตัวนำ”</p><p>สาย IEC 53 พิกัดแรงดันไฟฟ้า 300/500 V มีขนาดตัวนำตั้งแต่ 0.75 - 2.5 sq.mm.</p><p>ส่วนสาย VCT นั้น จะสามารถใช้งานพิกัดแรงดันไฟฟ้าได้มากกว่า ที่ 450/750 V และมีขนาดหน้าตัดตัวนำใหญ่กว่า เริ่มตั้งแต่ 4 - 35 sq.mm.</p><p>จุดสังเกตความแตกต่างกัน คือ ระดับแรงดันไฟฟ้า (300/500 V หรือ 450/750 V) ซึ่งจะมีระบุกำกับไว้อยู่บนเปลือกสายไฟ</p><p>ในด้านการใช้งาน สายทั้งคู่ เหมาะสำหรับการต่อเข้ากับดวงโคม อุปกรณ์ไฟฟ้า เครื่องจักร เนื่องจากเป็นสายที่มีลักษณะอ่อน และหุ้มฉนวนเปลือก 2 ชั้น จึงสามารถใช้งานในลักษณะที่มีการยกเคลื่อนย้ายหรือรองรับการสั่นสะเทือนได้ดี รวมถึงการติดตั้งบนรางเคเบิ้ล หรือเดินลอยในอากาศ ก็สามารถใช้ได้ทั้งคู่เช่นกัน</p><p>ข้อแตกต่างและข้อควรระวังสำคัญคือ สาย IEC 53 จะไม่สามารถติดตั้งโดยการฝังดินโดยตรง หรือ ร้อยท่อฝังดินได้ หากต้องการใช้งานใต้ดิน ควรใช้สาย VCT เท่านั้น</p><p>ที่สำคัญ อย่าลืมเลือกชนิดและขนาดตัวนำให้เหมาะสมกับพิกัดแรงดันไฟฟ้าที่จะนำไปติดตั้งใช้งาน และต้องเลือกใช้สายไฟยี่ห้อที่ได้มาตรฐาน เพื่อความปลอดภัยในการใช้งานด้วย</p><p>สะดวกสุดๆ ซื้อสายไฟออนไลน์ ราคาพิเศษ ส่งตรงจากคลัง ที่ <a href="https://linktr.ee/triplen.cable">https://linktr.ee/triplen.cable</a></p><p>#สายไฟฟ้าทริปเปิ้ลเอ็น #TripleNcable</p><p>#ทองแดงดีพีวีซีคุณภาพเต็มเมตรเต็มม้วน</p>',
      img: D2,
    },
    {
      id: 3,
      title: "เคล็ดลับ อ่าน Marking บนสายไฟ ที่ช่างไฟต้องรู้ ",
      htmlString:
        "<p>เพราะสายไฟในท้องตลาดส่วนใหญ่หากดูภายนอกแล้วมีหน้าตาที่แทบจะคล้ายกันหมด หากไม่ได้ปอกออกมาก็แทบจะแยกไม่ออกเลยว่าสายเส้นนั้นเป็นสายไฟชนิดไหน</p><p>แต่มีวิธีการง่ายๆกว่านั้น คือ การอ่าน Marking ที่พิมพ์ไว้บนสายไฟนั่นเอง ซึ่งสามารถดูวิธีการอ่านและรูปประกอบด้านบนเลย</p><p>ยกตัวอย่าง</p><p>✦ สายไฟ 60227 IEC 01 หรือ สายไฟ THW</p><p>✦ TRIPLE N : โลโก้หรือชื่อยี่ห้อสายไฟ, ชื่อผู้ผลิต</p><p>✦ 60227 IEC 01 THW : ชื่อชนิดสายไฟ ซึ่งในบางทีจะเป็นการบอกด้วยโครงสร้างของสายไฟเส้นนั้น</p><p>✦ 450/750V : ขนาดแรงดันไฟฟ้าที่เหมาะกับการใช้งานตามมาตรฐานกำหนด</p><p>✦ PVC : ชนิดของวัสดุฉนวนหุ้มตัวนำ</p><p>✦ 70 °C : อุณหภูมิใช้งานสูงสุดของตัวนำ</p><p>✦ 1 x 1.5 SQ.MM : จำนวนแกนของตัวนำ (1 แกน) และ ขนาดพื้นที่หน้าตัดของตัวนำ (1.5 ตร.มม.)</p><p>✦ TIS 11-2553 : มาตรฐานการผลิตของสายไฟ</p><p>หลังจากนี้ การจะหาสายไฟสักเส้นให้ตรงกับชนิดที่ต้องการ ก็ไม่ใช่เรื่องยากอีกต่อไปแล้ว</p><p>สายไฟชนิดอื่นๆที่นอกเหนือจากตัวอย่างก็จะอยู่ในรูปแบบมาตรฐานตามนี้ทั้งหมด แต่มีรายะเอียดต่างไปเล็กน้อยตามชนิดนั้นๆ</p>",
      img: D3,
    },
    {
      id: 4,
      title: "เคล็ดลับ อ่าน Marking บนสายไฟ ที่ช่างไฟต้องรู้ ",
      htmlString:
        "<p>เพราะเรื่องสายไฟ ไม่ใช่อะไรก็ได้ ถ้าไม่อยากเลือกพลาดจนอาจเกิดอันตราย ต้องเลือกซื่อตามวิธีนี้เลย</p><ol><li>ยี่ห้อของผู้ผลิตต้องมีมาตรฐาน และน่าเชื่อถือ</li><li>แพ็คเกจสายไฟอยู่ในสภาพสมบูรณ์</li><li>มีฉลาก และ Marking บนสายไฟระบุอย่างชัดเจน</li><li>มีสัญลักษณ์ได้รับรองมาตรฐาน มอก.</li><li>ตัวนำและฉนวน อยู่กึ่งกลางกันพอดี</li><li>รู้ชนิดสายไฟที่ต้องการ และจะนำไปใช้งานอย่างไร</li></ol><p>#สายไฟฟ้าทริปเปิ้ลเอ็น ผ่านการรับรองมาตรฐานอุตสาหกรรม(มอก.) ทุกชนิด จำหน่ายที่ร้านค้าและศูนย์ค้าวัสดุก่อสร้างชั้นนำทั่วประเทศ</p>",
      img: D4,
    },
  ];

  useEffect(() => {
    const result = arrContent.filter((item) => item.id === parseInt(id));
    setContent(result);
  }, []);

  return (
    <>
      <div className="indetail">
        <div className="indetail__container">
          <div className="indetail__title">
            <h5>หน้าแรก / ข่าวสารและบทความน่ารู้ / เกร็ดความรู้</h5>
          </div>
          {content.map((item, i) => (
            <>
              <div className="indetail__content">
                <div className="inner_con">
                  <div className="inner_title">
                    <h2>{item.title}</h2>
                  </div>
                  <div className="inner_img">
                    <img src={item.img} alt="" />
                  </div>
                  <div className="inner_content">
                    <p
                      style={{
                        textIndent: "2rem",
                        marginTop: "2rem",
                      }}
                    >
                      <div
                        dangerouslySetInnerHTML={{ __html: item.htmlString }}
                      ></div>
                    </p>
                  </div>
                </div>
                <div className="inner_other">
                  <div className="inner_other__title">
                    <h5>บทความที่เกี่ยวข้อง</h5>
                  </div>

                  {arrContent.map((item, i) => (
                    <div>
                      <a
                        href={`/news-page/${item.id}`}
                        style={{
                          textDecoration: "none",
                          color: "black",
                        }}
                      >
                        <div className="inner_other_body">
                          <div className="inner_other_img">
                            <img src={item.img} alt="" />
                          </div>
                          <div className="inner_other_text">
                            <p>{item.title}</p>
                          </div>
                        </div>
                      </a>
                    </div>
                  ))}
                </div>
              </div>
            </>
          ))}
        </div>
      </div>
    </>
  );
}

export default Indetail;
